app/controllers/api/v1/tickets_controller.rb

  def create
    status, object, errors = Ticket.create_ticket(ticket_params,excavator_params)
---
INSERT INTO "excavators" ("ticket_id", "company_name", "address", "city", "state", "zip_code", "crew_on_site", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "tickets" ("request_number", "sequence_number", "request_type", "primary_sa_code", "additional_sa_code", "digi_site_info", "due_date_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def show_ticket
    ticket  = Ticket.includes(:excavator).find_by(id: params[:id])
    if ticket.present?
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "excavators".* FROM "excavators" WHERE "excavators"."ticket_id" = $1  [["ticket_id", 1]]
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show_tickets
    tickets = Ticket.includes(:excavator).all
---
SELECT "excavators".* FROM "excavators" WHERE "excavators"."ticket_id" = $1  [["ticket_id", 1]]
SELECT "tickets".* FROM "tickets"