app/controllers/tickets_controller.rb

  def index
    @tickets = Ticket.includes(:excavator).all
---
SELECT "excavators".* FROM "excavators" WHERE "excavators"."ticket_id" IN ($1, $2, $3)  [["ticket_id", 1], ["ticket_id", 2], ["ticket_id", 3]]
SELECT "tickets".* FROM "tickets"

  def show
    @ticket = Ticket.includes(:excavator).find(params[:id])
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "excavators".* FROM "excavators" WHERE "excavators"."ticket_id" = $1  [["ticket_id", 4]]