app/models/ticket.rb

INSERT INTO "tickets" ("request_number", "sequence_number", "request_type", "primary_sa_code", "additional_sa_code", "digi_site_info", "due_date_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "excavators" ("ticket_id", "company_name", "address", "city", "state", "zip_code", "crew_on_site", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def self.create_ticket(ticket_params, excavator_params)
    ActiveRecord::Base.transaction do
      ticket = self.new(ticket_params)
      ticket.save!
      excavator = Excavator.new(excavator_params.merge(ticket: ticket))
      return  [true, ticket, nil] if excavator.save!(excavator_params)